Dlubal.DynamPro.MCParams
mass case parameters

Dlubal.DynamPro.MCParams.Number
mass case number (read only)

Dlubal.DynamPro.MCParams.Type
mass case type

Dlubal.DynamPro.MCParams.Description
Description

Dlubal.DynamPro.MCParams.ImportMassesFromSelfWeight
Apply self-weight mass

Dlubal.DynamPro.MCParams.MassFromLoadImportType
Apply mass imported from selected Load Case or Load Combination

Dlubal.DynamPro.MCParams.MassImportLoadNo
Selected Load Case or Load Combination to import masses from.

Dlubal.DynamPro.MCParams.ApplyListedMassesNode
Apply listed node masses

Dlubal.DynamPro.MCParams.NodeMasses
Listed node masses

Dlubal.DynamPro.MCParams.ApplyListedMassesLine
Apply listed line masses

Dlubal.DynamPro.MCParams.LineMasses
Listed line masses

Dlubal.DynamPro.MCParams.ApplyListedMassesMember
Apply listed member masses

Dlubal.DynamPro.MCParams.MemberMasses
Listed member masses

Dlubal.DynamPro.MCParams.ApplyListedMassesSurface
Apply listed surface masses

Dlubal.DynamPro.MCParams.SurfaceMasses
Listed surface masses

Dlubal.DynamPro.MCParams.Comment
Comment